; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
          (LOCATION ?loc)
		      (AIRPLANE ?airplane)
          (CITY ?city)
          (AIRPORT ?airport)
		      (at ?obj ?loc)
		      (in ?obj1 ?obj2)
		      (in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s3-p22-a3)
(:domain logistics-strips)
(:objects a0 a1 a2 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (OBJ p17)
    (OBJ p18)
    (OBJ p19)
    (OBJ p20)
    (OBJ p21)
    (at t0 l0-0)
    (at t1 l1-1)
    (at t2 l2-0)
    (at p0 l0-1)
    (at p1 l0-1)
    (at p2 l0-2)
    (at p3 l0-1)
    (at p4 l2-1)
    (at p5 l1-1)
    (at p6 l1-0)
    (at p7 l0-0)
    (at p8 l1-2)
    (at p9 l1-0)
    (at p10 l0-2)
    (at p11 l1-1)
    (at p12 l1-2)
    (at p13 l0-2)
    (at p14 l0-2)
    (at p15 l2-1)
    (at p16 l1-1)
    (at p17 l0-2)
    (at p18 l0-1)
    (at p19 l1-0)
    (at p20 l2-2)
    (at p21 l2-0)
    (at a0 l2-0)
    (at a1 l2-0)
    (at a2 l2-0)
)
(:goal
    (and
        (at p0 l0-2)
        (at p1 l0-1)
        (at p2 l2-1)
        (at p3 l2-2)
        (at p4 l0-1)
        (at p5 l0-0)
        (at p6 l1-1)
        (at p7 l2-1)
        (at p8 l1-0)
        (at p9 l0-2)
        (at p10 l1-0)
        (at p11 l2-2)
        (at p12 l1-0)
        (at p13 l0-2)
        (at p14 l0-2)
        (at p15 l2-1)
        (at p16 l2-1)
        (at p17 l1-1)
        (at p18 l0-0)
        (at p19 l2-1)
        (at p20 l2-0)
        (at p21 l2-1)
    )
)
)

; plan
1. (load-truck p21 t2 l2-0)
   deleted: (at p21 l2-0)
   added: (in p21 t2)
   goals met: 4 of 22
2. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 4 of 22
3. (load-truck p4 t2 l2-1)
   deleted: (at p4 l2-1)
   added: (in p4 t2)
   goals met: 4 of 22
4. (unload-truck p21 t2 l2-1)
   deleted: (in p21 t2)
   added: (at p21 l2-1)
   goals met: 5 of 22
5. (drive-truck t2 l2-1 l2-2 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-2)
   goals met: 5 of 22
6. (load-truck p20 t2 l2-2)
   deleted: (at p20 l2-2)
   added: (in p20 t2)
   goals met: 5 of 22
7. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 5 of 22
8. (unload-truck p4 t2 l2-0)
   deleted: (in p4 t2)
   added: (at p4 l2-0)
   goals met: 5 of 22
9. (unload-truck p20 t2 l2-0)
   deleted: (in p20 t2)
   added: (at p20 l2-0)
   goals met: 6 of 22
10. (load-airplane p4 a2 l2-0)
   deleted: (at p4 l2-0)
   added: (in p4 a2)
   goals met: 6 of 22
11. (fly-airplane a2 l2-0 l1-0)
   deleted: (at a2 l2-0)
   added: (at a2 l1-0)
   goals met: 6 of 22
12. (load-truck p5 t1 l1-1)
   deleted: (at p5 l1-1)
   added: (in p5 t1)
   goals met: 6 of 22
13. (load-truck p16 t1 l1-1)
   deleted: (at p16 l1-1)
   added: (in p16 t1)
   goals met: 6 of 22
14. (load-truck p11 t1 l1-1)
   deleted: (at p11 l1-1)
   added: (in p11 t1)
   goals met: 6 of 22
15. (drive-truck t1 l1-1 l1-2 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 6 of 22
16. (load-truck p8 t1 l1-2)
   deleted: (at p8 l1-2)
   added: (in p8 t1)
   goals met: 6 of 22
17. (load-truck p12 t1 l1-2)
   deleted: (at p12 l1-2)
   added: (in p12 t1)
   goals met: 6 of 22
18. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 6 of 22
19. (unload-truck p8 t1 l1-0)
   deleted: (in p8 t1)
   added: (at p8 l1-0)
   goals met: 7 of 22
20. (load-truck p6 t1 l1-0)
   deleted: (at p6 l1-0)
   added: (in p6 t1)
   goals met: 7 of 22
21. (unload-truck p5 t1 l1-0)
   deleted: (in p5 t1)
   added: (at p5 l1-0)
   goals met: 7 of 22
22. (unload-truck p16 t1 l1-0)
   deleted: (in p16 t1)
   added: (at p16 l1-0)
   goals met: 7 of 22
23. (unload-truck p12 t1 l1-0)
   deleted: (in p12 t1)
   added: (at p12 l1-0)
   goals met: 8 of 22
24. (unload-truck p11 t1 l1-0)
   deleted: (in p11 t1)
   added: (at p11 l1-0)
   goals met: 8 of 22
25. (load-airplane p9 a2 l1-0)
   deleted: (at p9 l1-0)
   added: (in p9 a2)
   goals met: 8 of 22
26. (load-airplane p5 a2 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 a2)
   goals met: 8 of 22
27. (load-airplane p19 a2 l1-0)
   deleted: (at p19 l1-0)
   added: (in p19 a2)
   goals met: 8 of 22
28. (load-airplane p16 a2 l1-0)
   deleted: (at p16 l1-0)
   added: (in p16 a2)
   goals met: 8 of 22
29. (fly-airplane a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 8 of 22
30. (unload-airplane p9 a2 l0-0)
   deleted: (in p9 a2)
   added: (at p9 l0-0)
   goals met: 8 of 22
31. (load-truck p9 t0 l0-0)
   deleted: (at p9 l0-0)
   added: (in p9 t0)
   goals met: 8 of 22
32. (load-airplane p7 a2 l0-0)
   deleted: (at p7 l0-0)
   added: (in p7 a2)
   goals met: 8 of 22
33. (unload-airplane p5 a2 l0-0)
   deleted: (in p5 a2)
   added: (at p5 l0-0)
   goals met: 9 of 22
34. (unload-airplane p4 a2 l0-0)
   deleted: (in p4 a2)
   added: (at p4 l0-0)
   goals met: 9 of 22
35. (load-truck p4 t0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 t0)
   goals met: 9 of 22
36. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 9 of 22
37. (unload-truck p4 t0 l0-1)
   deleted: (in p4 t0)
   added: (at p4 l0-1)
   goals met: 10 of 22
38. (load-truck p3 t0 l0-1)
   deleted: (at p3 l0-1)
   added: (in p3 t0)
   goals met: 10 of 22
39. (load-truck p18 t0 l0-1)
   deleted: (at p18 l0-1)
   added: (in p18 t0)
   goals met: 10 of 22
40. (load-truck p0 t0 l0-1)
   deleted: (at p0 l0-1)
   added: (in p0 t0)
   goals met: 10 of 22
41. (drive-truck t0 l0-1 l0-2 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-2)
   goals met: 10 of 22
42. (unload-truck p9 t0 l0-2)
   deleted: (in p9 t0)
   added: (at p9 l0-2)
   goals met: 11 of 22
43. (load-truck p2 t0 l0-2)
   deleted: (at p2 l0-2)
   added: (in p2 t0)
   goals met: 11 of 22
44. (load-truck p17 t0 l0-2)
   deleted: (at p17 l0-2)
   added: (in p17 t0)
   goals met: 11 of 22
45. (load-truck p10 t0 l0-2)
   deleted: (at p10 l0-2)
   added: (in p10 t0)
   goals met: 11 of 22
46. (unload-truck p0 t0 l0-2)
   deleted: (in p0 t0)
   added: (at p0 l0-2)
   goals met: 12 of 22
47. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 12 of 22
48. (unload-truck p3 t0 l0-0)
   deleted: (in p3 t0)
   added: (at p3 l0-0)
   goals met: 12 of 22
49. (unload-truck p2 t0 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 12 of 22
50. (unload-truck p18 t0 l0-0)
   deleted: (in p18 t0)
   added: (at p18 l0-0)
   goals met: 13 of 22
51. (unload-truck p17 t0 l0-0)
   deleted: (in p17 t0)
   added: (at p17 l0-0)
   goals met: 13 of 22
52. (unload-truck p10 t0 l0-0)
   deleted: (in p10 t0)
   added: (at p10 l0-0)
   goals met: 13 of 22
53. (load-airplane p3 a2 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 a2)
   goals met: 13 of 22
54. (load-airplane p2 a2 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a2)
   goals met: 13 of 22
55. (load-airplane p17 a2 l0-0)
   deleted: (at p17 l0-0)
   added: (in p17 a2)
   goals met: 13 of 22
56. (load-airplane p10 a2 l0-0)
   deleted: (at p10 l0-0)
   added: (in p10 a2)
   goals met: 13 of 22
57. (fly-airplane a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 13 of 22
58. (unload-airplane p17 a2 l1-0)
   deleted: (in p17 a2)
   added: (at p17 l1-0)
   goals met: 13 of 22
59. (load-truck p17 t1 l1-0)
   deleted: (at p17 l1-0)
   added: (in p17 t1)
   goals met: 13 of 22
60. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 13 of 22
61. (unload-truck p6 t1 l1-1)
   deleted: (in p6 t1)
   added: (at p6 l1-1)
   goals met: 14 of 22
62. (unload-truck p17 t1 l1-1)
   deleted: (in p17 t1)
   added: (at p17 l1-1)
   goals met: 15 of 22
63. (load-airplane p11 a2 l1-0)
   deleted: (at p11 l1-0)
   added: (in p11 a2)
   goals met: 15 of 22
64. (unload-airplane p10 a2 l1-0)
   deleted: (in p10 a2)
   added: (at p10 l1-0)
   goals met: 16 of 22
65. (fly-airplane a2 l1-0 l2-0)
   deleted: (at a2 l1-0)
   added: (at a2 l2-0)
   goals met: 16 of 22
66. (unload-airplane p7 a2 l2-0)
   deleted: (in p7 a2)
   added: (at p7 l2-0)
   goals met: 16 of 22
67. (load-truck p7 t2 l2-0)
   deleted: (at p7 l2-0)
   added: (in p7 t2)
   goals met: 16 of 22
68. (unload-airplane p3 a2 l2-0)
   deleted: (in p3 a2)
   added: (at p3 l2-0)
   goals met: 16 of 22
69. (load-truck p3 t2 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 t2)
   goals met: 16 of 22
70. (unload-airplane p2 a2 l2-0)
   deleted: (in p2 a2)
   added: (at p2 l2-0)
   goals met: 16 of 22
71. (load-truck p2 t2 l2-0)
   deleted: (at p2 l2-0)
   added: (in p2 t2)
   goals met: 16 of 22
72. (unload-airplane p19 a2 l2-0)
   deleted: (in p19 a2)
   added: (at p19 l2-0)
   goals met: 16 of 22
73. (load-truck p19 t2 l2-0)
   deleted: (at p19 l2-0)
   added: (in p19 t2)
   goals met: 16 of 22
74. (unload-airplane p16 a2 l2-0)
   deleted: (in p16 a2)
   added: (at p16 l2-0)
   goals met: 16 of 22
75. (load-truck p16 t2 l2-0)
   deleted: (at p16 l2-0)
   added: (in p16 t2)
   goals met: 16 of 22
76. (unload-airplane p11 a2 l2-0)
   deleted: (in p11 a2)
   added: (at p11 l2-0)
   goals met: 16 of 22
77. (load-truck p11 t2 l2-0)
   deleted: (at p11 l2-0)
   added: (in p11 t2)
   goals met: 16 of 22
78. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 16 of 22
79. (unload-truck p7 t2 l2-1)
   deleted: (in p7 t2)
   added: (at p7 l2-1)
   goals met: 17 of 22
80. (unload-truck p2 t2 l2-1)
   deleted: (in p2 t2)
   added: (at p2 l2-1)
   goals met: 18 of 22
81. (unload-truck p19 t2 l2-1)
   deleted: (in p19 t2)
   added: (at p19 l2-1)
   goals met: 19 of 22
82. (unload-truck p16 t2 l2-1)
   deleted: (in p16 t2)
   added: (at p16 l2-1)
   goals met: 20 of 22
83. (drive-truck t2 l2-1 l2-2 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-2)
   goals met: 20 of 22
84. (unload-truck p3 t2 l2-2)
   deleted: (in p3 t2)
   added: (at p3 l2-2)
   goals met: 21 of 22
85. (unload-truck p11 t2 l2-2)
   deleted: (in p11 t2)
   added: (at p11 l2-2)
   goals met: 22 of 22
